In [4]:
import pandas as pd

In [5]:
# reading the csv file
df_exams = pd.read_csv('StudentsPerformance.csv')

#Attributes

In [6]:
# getting access to the shape 
df_exams.shape

(1000, 8)

In [7]:
# getting the index of the dataframe
df_exams.index

RangeIndex(start=0, stop=1000, step=1)

In [8]:
# getting access to the column attribute
df_exams.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [9]:
# data type of each column
df_exams.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [12]:
# describing basic statistics
df_exams.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [6]:
# obtaining the length of the dataframe(number of rows)
len(df_exams)

1000

In [8]:
# obtaining the highest index in the dataframe
max(df_exams.index)

999

In [9]:
# obtaining the lowest index in the dataframe
min(df_exams.index)

0

In [10]:
# obtaining the data type of the dataframe
type(df_exams)

pandas.core.frame.DataFrame

In [11]:
# rounding the values of the dataset
round(df_exams, 2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86